benchmark/FieldExamples/iterativeCouplingDummyCSMAndOF/idealizedPiston_cfd/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    fsiWall
    {
        type            zeroGradient;
    }

    fixedWallZ
    {
        type            zeroGradient;
    }

    fixedWallYOutlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    fixedWallX
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
