benchmark/FieldExamples/iterativeCouplingDummyCSMAndOF/idealizedPiston_cfd/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    fsiWall
    {
        type               timeVaryingUniformFixedValue;
        fileName           "0/movingFSI.dat"; 
        outOfBounds        clamp;
        //type            fixedValue;
        //value           uniform  (0 0 0);
    }

    fixedWallZ
    {
        type            slip;
    }
    
    fixedWallX
    {
        type            slip;
    }
    
    fixedWallYOutlet
    {
        type            fixedValue;
        value           uniform  (0 0 0);
    }
}

// ************************************************************************* //
